# List Comprehension and Pandas Exercises

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
# List Comprehension yapısı kullanarak car_crashes verisindeki numeric değişkenlerin isimlerini büyük harfe çeviriniz ve başına NUM ekleyiniz.

df = sns.load_dataset("car_crashes")

m = [x if ("no") in x else x + "_FLAG" for x in df.columns]

['total_FLAG',
 'speeding_FLAG',
 'alcohol_FLAG',
 'not_distracted',
 'no_previous',
 'ins_premium_FLAG',
 'ins_losses_FLAG',
 'abbrev_FLAG']

In [3]:
# Numerik olmayanların da isimleri büyümeli.
# Tek bir list comp yapısı ile yapılmalı.

og_list = ["abbrev","no_previous"]

new_col = [x for x in df.columns if x not in og_list]
new_df = df[new_col]

new_df.head()

   total  speeding  alcohol  not_distracted  ins_premium  ins_losses
0   18.8     7.332    5.640          18.048       784.55      145.08
1   18.1     7.421    4.525          16.290      1053.48      133.93
2   18.6     6.510    5.208          15.624       899.47      110.35
3   22.4     4.032    5.824          21.056       827.34      142.39
4   12.0     4.200    3.360          10.920       878.41      165.63

In [4]:
#q1 - Görev 1:  Seaborn kütüphanesi içerisinden Titanicveri setini tanımlayınız.
titanic = sns.load_dataset("titanic")

In [5]:
#g2 - Görev 2:  Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.
q2 = titanic.groupby("sex")["sex"].agg("count")
q2

sex
female    314
male      577
Name: sex, dtype: int64

In [6]:
#g3 - Görev 3: Her bir sutuna ait unique değerlerin sayısını bulunuz.
q3 = titanic.nunique()
q3

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [7]:
#g4 - Görev 4: pclass değişkeninin unique değerleri bulunuz.
q4 = titanic.groupby("pclass")['pclass'].agg("count")
q4

pclass
1    216
2    184
3    491
Name: pclass, dtype: int64

In [8]:
#g5 - Görev 5:  pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.
q5 = titanic[["pclass","parch"]].nunique()
q5

pclass    3
parch     7
dtype: int64

In [9]:
#g6 - Görev 6: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz. Tekrar tipini kontrol ediniz.
type(titanic["embarked"])
titanic["embarked"] = titanic["embarked"].astype("category")
q6 = type(titanic["embarked"])
q6

pandas.core.series.Series

In [10]:
#g7 - Görev 7: embarked değeri C olanların tüm bilgelerini gösteriniz.
q7 = titanic[titanic["embarked"] == "C"]
q7.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True

In [11]:
#g8 - Görev 8: embarked değeri S olmayanların tüm bilgelerini gösteriniz.
q8 = titanic[titanic["embarked"] != "S"]
q8.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True

In [12]:
#g9 - Görev 9: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.
q9 = titanic[(titanic["sex"] == "female") & (titanic["age"] < 30)]
q9.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True

In [13]:
#g10 - Görev 10: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.
q10 = titanic[(titanic["fare"] > 500) | (titanic["age"] > 70)]
q10.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True

In [14]:
#q11 - Görev 11: Her bir değişkendeki boş değerlerin toplamını bulunuz.
q11 = titanic.isna().sum()
q11

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [15]:
#12 - Görev 12: who değişkenini dataframe'den düşürün.
q12 = titanic.drop("who", axis=1)
q12.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,True,NaN,Southampton,no,True

In [16]:
#13 - Görev 13: deck değikenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.
titanic["deck"] = titanic["deck"].fillna(titanic["deck"].mode()[0])
q13 = titanic["deck"]
q13.head()

0    C
1    C
2    C
3    C
4    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [17]:
#14 - Görev 14: age değikenindeki boş değerleri age değişkenin medyanı ile doldurun.
titanic["age"] = titanic["age"].fillna(titanic["age"].median())
q14 = titanic
q14.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [18]:
#15 - Görev 15: survived değişkeninin Pclass ve Cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.
q15 = titanic.groupby(["pclass","sex"])["survived"].agg(["sum","count","mean"])
q14.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [19]:
#16 - Görev 16:  30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazınız.
# Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz oluşturunuz. (apply ve lambda yapılarını kullanınız.
def age_func(x):
    if x < 30:
        return 1.30
    else:
        return 0
titanic["age_flag"] = titanic["age"].apply(lambda x: age_func(x))
q16 = titanic
q16.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_flag
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False,1.3
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True,1.3
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True,0.0

In [20]:
#17 - Görev 17: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.
tips = sns.load_dataset("tips")
q17 = tips.head()
q17.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [21]:
#18 - Görev 18: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill  değerlerinin toplamını, min, max ve ortalamasını bulunuz.
q18 = tips.groupby("time")["total_bill"].agg(["sum", "min", "max", "mean"])
q18

            sum   min    max       mean
time
Lunch   1167.47  7.51  43.11  17.168676
Dinner  3660.30  3.07  50.81  20.797159

In [22]:
#19 - Görev 19: Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.
q19 = tips.pivot_table("total_bill", "day", "time", aggfunc=(["sum", "min", "max", "mean"]))
q19

          sum            min           max              mean
time    Lunch   Dinner Lunch Dinner  Lunch Dinner      Lunch     Dinner
day
Thur  1077.55    18.78  7.51  18.78  43.11  18.78  17.664754  18.780000
Fri     89.92   235.96  8.58   5.75  16.27  40.17  12.845714  19.663333
Sat      0.00  1778.40   NaN   3.07    NaN  50.81        NaN  20.441379
Sun      0.00  1627.16   NaN   7.25    NaN  48.17        NaN  21.410000

In [23]:
#20 - Görev 20:Lunch zamanına ve kadın müşterilere ait total_bill ve tip  değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.
filter = tips[(tips["time"] =="Lunch") & (tips["sex"] =="Female")]
q20 = filter.pivot_table(["total_bill", "tip"], "day", aggfunc=(["sum", "min", "max", "mean"]))
q20

        sum              min              max                 mean
        tip total_bill   tip total_bill   tip total_bill       tip total_bill
day
Thur  79.42     516.11  1.25       8.35  5.17      43.11  2.561935   16.64871
Fri   10.98      55.76  2.00      10.09  3.48      16.27  2.745000   13.94000
Sat    0.00       0.00   NaN        NaN   NaN        NaN       NaN        NaN
Sun    0.00       0.00   NaN        NaN   NaN        NaN       NaN        NaN

In [24]:
#21 - Görev 21: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir?
q21 = tips[(tips.loc[ : , "size"] <3) & (tips.loc[ : , "total_bill"] > 10)]["total_bill"].sum()
q21

2457.45

In [25]:
#22 - Görev 22: total_bill_tip_sum adında yeni bir değişken oluşturun. Her bir müşterinin ödediği totalbill ve tip in toplamını versin.
tips["total_bill_tip_sum"] = tips["total_bill"] + tips["tip"]
q22 = tips
q22.head()

   total_bill   tip     sex smoker  day    time  size  total_bill_tip_sum
0       16.99  1.01  Female     No  Sun  Dinner     2               18.00
1       10.34  1.66    Male     No  Sun  Dinner     3               12.00
2       21.01  3.50    Male     No  Sun  Dinner     3               24.51
3       23.68  3.31    Male     No  Sun  Dinner     2               26.99
4       24.59  3.61  Female     No  Sun  Dinner     4               28.20

In [26]:
#23 - Görev 23: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız
q23 = tips.sort_values("total_bill_tip_sum", ascending=False).head(30)
q23.head()

     total_bill    tip   sex smoker  day    time  size  total_bill_tip_sum
170       50.81  10.00  Male    Yes  Sat  Dinner     3               60.81
212       48.33   9.00  Male     No  Sat  Dinner     4               57.33
59        48.27   6.73  Male     No  Sat  Dinner     4               55.00
156       48.17   5.00  Male     No  Sun  Dinner     6               53.17
182       45.35   3.50  Male    Yes  Sun  Dinner     3               48.85